pandas DataFrames

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
lst = [1,2,3,4]
df = pd.DataFrame(lst)
df

In [ ]:
lst = [[1,2,3,4],[5,6,7,8,9]]
df = pd.DataFrame(lst)
df

In [ ]:
a =[{'a':1, 'b' : 2, 'c':4,'d':0},{'a':5, 'b' : 6, 'c':7}]
df =  pd.DataFrame(a)
df

In [ ]:
b = {'usn': pd.Series([1,2,3,4]),
     'math': pd.Series([24,87,99,100]),
     'chem':pd.Series([12,34,56,78])}
df = pd.DataFrame(b)
df

#Redaing CSV as DataFrames

In [4]:
df = pd.read_csv(r'D:\Notes\Excel works\salary_dataset.csv')
df

   EmployeeID           Name Department  Salary  Experience       Location
0           1       John Doe         IT   75000           5       New York
1           2     Jane Smith         HR   68000           4        Chicago
2           3      Sam Brown    Finance   80000           6  San Francisco
3           4    Linda Green         IT   72000           3         Boston
4           5  Michael White         HR   70000           7    Los Angeles
5           6    Sarah Black    Finance   90000           8        Seattle
6           7    Robert Blue         IT   65000           2         Austin
7           8   Karen Yellow         HR   75000           5          Miami
8           9     Emily Pink    Finance   85000           6       New York
9          10    Daniel Gray         IT   78000           7      San Diego

In [ ]:
type(df)

In [6]:
df.dtypes.value_counts()

int64     3
object    3
Name: count, dtype: int64